app/controllers/busca_controller.rb

SELECT * FROM `notices` WHERE (((notices.title LIKE '%%' OR notices.body LIKE '%%' OR notices.summary LIKE '%%')))
SELECT * FROM `products` WHERE (((products.title LIKE '%%' OR products.description LIKE '%%')))
SELECT * FROM `cases` WHERE (((cases.title LIKE '%%' OR cases.sumary LIKE '%%' OR cases.body LIKE '%%')))
---
  def index
    if !params[:s].blank?
      @Termo = params[:s]
      #BUSCA NOTICIAS
      @Noticias = Notice.find(:all) do
        any do
          title.contains? params[:s]
          body.contains? params[:s]
          summary.contains? params[:s]
        end
      end

      #BUSCA PRODUTOS
      @Produtos = Product.find(:all) do
        any do
          title.contains? params[:s]
          description.contains? params[:s]
        end
      end

      #BUSCA CASES
      @Cases = Case.find(:all) do