app/controllers/cases_controller.rb

    def index
      @Cases = Case.all(:conditions => ['published = 1'], :group => "category")
---
SELECT * FROM `cases` WHERE (published = 1) GROUP BY category

  def categoria
     @Cases = Case.all(:conditions => ['published = 1 AND category = ?', params[:id]])
---
SELECT * FROM `cases` WHERE (published = 1 AND category = NULL)

  def show
      @Case = Case.find(params[:id])

      #SELECIONA IMAGENS
      @Imagens = @Case.case_images.all
---
SELECT * FROM `cases` WHERE (`cases`.`id` = 3)
SELECT * FROM `case_images` WHERE (`case_images`.case_id = 3)