app/controllers/categorias_controller.rb

  def show
    @Section = Section.find(params[:linha_id])

    @Categoria = @Section.categories.find(params[:id])

    @Produtos = @Categoria.products.find(:all, :conditions => ['published = 1'])
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 2)
SELECT * FROM `categories` WHERE (`categories`.`id` = 3 AND (`categories`.section_id = 2))
SELECT * FROM `products` WHERE (`products`.category_id = 1 AND (published = 1))