app/controllers/depoimentos_controller.rb

SELECT * FROM `testimonials` WHERE (published = 1)
---
  def index
    @Depoimentos = Testimonial.all(:conditions => ['published = 1'])