app/controllers/eventos_controller.rb

  def index
    @Eventos = Event.all(:conditions => ['published = 1'])
---
SELECT * FROM `events` WHERE (published = 1)

  def show
    @Evento = Event.find(params[:id])

    #SELECIONA GALERIAS
    @Galerias = @Evento.event_galleries.all
---
SELECT * FROM `events` WHERE (`events`.`id` = 3)
SELECT * FROM `event_galleries` WHERE (`event_galleries`.`id` = 1 AND (`event_galleries`.event_id = 1))
SELECT * FROM `events` LIMIT 1