app/controllers/galerias_controller.rb

    def show
      @Galeria = EventGallery.find(params[:id])

      #SELECIONA IMAGENS
      @Imagens = @Galeria.event_gallery_images.all
---
SELECT * FROM `event_galleries` WHERE (`event_galleries`.`id` = 1)
SELECT * FROM `event_galleries`
SELECT * FROM `event_gallery_images` WHERE (`event_gallery_images`.event_gallery_id = 1)