app/controllers/home_controller.rb

    def index
      @Servidor =  "http://localhost:3002"
      @Highlights = Highlight.find(:all, :conditions => ['published = 1'])

      @Case = Case.find(:first, :conditions => ['published = 1'], :order => 'id DESC', :limit => 1)
---
SELECT * FROM `highlights` WHERE (published = 1) ORDER BY position DESC
SELECT * FROM `cases` WHERE (published = 1) ORDER BY id DESC LIMIT 1