app/controllers/home_controller.rb

    def index
      @Noticias = Notice.all
---
SELECT * FROM `notices`