app/controllers/imprensa_controller.rb

    def index
      #CONFIG DO SERVER ESTA NO PARTIAL _right.html.erb
      #@Servidor = "http://192.168.1.103:3002"
      #@Servidor = "htt//admin.fasterm.com.br"

      @DynamicPage = DynamicPage.find(:first, :conditions => ['id = 5 AND published = 1'])

      #@Conteudo = @DynamicPage.body
      @Imagem = @DynamicPage.image.url
      @Legenda = @DynamicPage.legend
      @Titulo = @DynamicPage.title

      @Header = Header.first(:conditions => ['dynamic_page_id = ? AND published = 1', 5], :order => 'id DESC')
---
SELECT * FROM `dynamic_pages` WHERE (id = 1 AND published = 1) LIMIT 1
SELECT * FROM `headers` WHERE (dynamic_page_id = 1 AND published = 1) ORDER BY id DESC LIMIT 1