app/controllers/linhas_controller.rb

  def show
    @Section = Section.find(params[:id])

    @Categorias = @Section.categories.all(:conditions => ['published = 1'])
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 2)
SELECT * FROM `categories` WHERE (published = 1) AND (`categories`.section_id = 2)