app/controllers/newsletters_controller.rb

  def show
    @Newsletter = Newsletter.find(params[:id])
---
SELECT * FROM `newsletters` WHERE (`newsletters`.`id` = 1)

  def create
    @Newsletter = Newsletter.create(params[:newsletter])
---
INSERT INTO `newsletters` (`created_at`, `updated_at`, `email`) VALUES('2010-05-07 02:21:39', '2010-05-07 02:21:39', 'aaa')