app/controllers/noticias_controller.rb

  def index
      @Noticias = Notice.all(:conditions => ['published = 1'], :order => "created_at DESC")
---
SELECT * FROM `notices` WHERE (published = 1) ORDER BY id DESC LIMIT 1

  def show
      @Noticia = Notice.find(params[:id])

      #SELECIONA IMAGENS
      @Imagens = @Noticia.notice_images.all
---
SELECT * FROM `notices` WHERE (`notices`.`id` = 1)
SELECT * FROM `notice_images` WHERE (`notice_images`.notice_id = 1)
SELECT * FROM `notices` LIMIT 1