app/controllers/produtos_controller.rb

  def show
    @Section = Section.find(params[:linha_id])

    @Categoria = @Section.categories.find(params[:categoria_id])

    @Produto = @Categoria.products.find(params[:id])

    @Imagens = @Produto.product_images.find(:all)
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 2)
SELECT * FROM `categories` WHERE (`categories`.`id` = 1 AND (`categories`.section_id = 2))
SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.category_id = 1))
SELECT * FROM `product_images` WHERE (`product_images`.product_id = 1 AND (published = 1)) LIMIT 1