app/controllers/request_catalogs_controller.rb

  def show
    @RequestCatalog = RequestCatalog.find(params[:id])
---
SELECT * FROM `request_catalogs` WHERE (`request_catalogs`.`id` = 5)

  def create
    @RequestCatalog = RequestCatalog.create(params[:request_catalog])
---
INSERT INTO `request_catalogs` (`name`, `address`, `number`, `city`, `aplicacao`, `created_at`, `updated_at`, `postalcode`, `tipo_existente`, `email`, `state`) VALUES('teste', NULL, NULL, NULL, NULL, '2010-05-24 16:31:38', '2010-05-24 16:31:38', NULL, NULL, 'teste', NULL)

  def edit
        @RequestCatalog = RequestCatalog.find(params[:id])
---
SELECT * FROM `request_catalogs` WHERE (`request_catalogs`.`id` = 1)

  def update
      @RequestCatalog = RequestCatalog.find(params[:id])
      @RequestCatalog.attributes = params[:request_catalog]

      if @RequestCatalog.save
---
SELECT * FROM `request_catalogs` WHERE (`request_catalogs`.`id` = 5)
UPDATE `request_catalogs` SET `updated_at` = '2010-05-07 14:28:14', `number` = '56', `address` = 'R.1', `city` = '123123', `state` = '123123123', `postalcode` = '123123123' WHERE `id` = 5