app/controllers/schedule_visits_controller.rb

SELECT * FROM `schedule_visits` WHERE (`schedule_visits`.`id` = 5)
---
  def show
    @ScheduleVisit = ScheduleVisit.find(params[:id])

INSERT INTO `schedule_visits` (`name`, `number`, `city`, `created_at`, `updated_at`, `adress`, `postalcode`, `phone`, `email`, `state`) VALUES('aouu', NULL, NULL, '2010-05-07 02:58:51', '2010-05-07 02:58:51', NULL, NULL, NULL, 'testE@TESTE.com.br', NULL)
---
  def create
    @ScheduleVisit = ScheduleVisit.create(params[:schedule_visit])

SELECT * FROM `schedule_visits` WHERE (`schedule_visits`.`id` = 2)
---
  def edit
        @ScheduleVisit = ScheduleVisit.find(params[:id])

SELECT * FROM `schedule_visits` WHERE (`schedule_visits`.`id` = 4)
UPDATE `schedule_visits` SET `phone` = 'teste', `updated_at` = '2010-05-07 03:03:29', `number` = '1\'', `adress` = 'teste', `city` = 'teste', `state` = 'teste', `postalcode` = 'teste' WHERE `id` = 4
---
  def update
      @ScheduleVisit = ScheduleVisit.find(params[:id])
      @ScheduleVisit.attributes = params[:schedule_visit]

      if @ScheduleVisit.save