app/controllers/sessions_controller.rb

SELECT * FROM `partners` WHERE (email = '' AND password = '') LIMIT 1
---
  def create
    @Partner = Partner.find(:first, :conditions => ['email = ? AND password = ?', params[:email], params[:senha]])