app/controllers/sitecontacts_controller.rb

  def show
    @Contato = Sitecontact.find(params[:id])
---
SELECT * FROM `sitecontacts` WHERE (`sitecontacts`.`id` = 3)

  def create
    @Contato = Sitecontact.create(params[:sitecontact])
---
INSERT INTO `sitecontacts` (`name`, `company`, `city`, `created_at`, `updated_at`, `phone`, `message`, `email`, `state`) VALUES('Rafael de Matuoka r Chiocchetti', 'Agencia Economica', 'Atibaia', '2010-05-24 18:25:49', '2010-05-24 18:25:49', '11 4411 4707', 'Olá', 'rmatuoka@agenciaeconomica.com.br', 'SP')