app/controllers/sustentabilidade_controller.rb

SELECT * FROM `dynamic_pages` WHERE (id = 3 AND published = 1) LIMIT 1
SELECT * FROM `headers` WHERE (dynamic_page_id = 4 AND published = 1) ORDER BY id DESC LIMIT 1
---
    def index
      #CONFIG DO SERVER ESTA NO PARTIAL _right.html.erb
      #@Servidor = "http://192.168.1.103:3002"
      #@Servidor = "htt//admin.fasterm.com.br"

      @DynamicPage = DynamicPage.first(:conditions => ['id = 4 AND published = 1'])

      @Conteudo = @DynamicPage.body
      @Imagem = @DynamicPage.image.url
      @Legenda = @DynamicPage.legend
      @Titulo = @DynamicPage.title

      @Header = Header.first(:conditions => ['dynamic_page_id = ? AND published = 1', 4], :order => 'id DESC')