app/controllers/testimonials_controller.rb

  def create
    @Testimonial = Testimonial.create(params[:testimonial])
    @Testimonial.published = 0

    if @Testimonial.save
---
INSERT INTO `testimonials` (`name`, `position`, `company`, `created_at`, `updated_at`, `published`, `testimonial`) VALUES('teste', 'teste', 'teste', '2010-10-20 13:49:21', '2010-10-20 13:49:21', NULL, 'asdasd')
UPDATE `testimonials` SET `updated_at` = '2010-10-20 13:54:16', `published` = 0 WHERE `id` = 4